app/controllers/listings_controller.rb

  def index
    @listings = Listing.all.order("created_at DESC")
---
SELECT "listings".* FROM "listings"  ORDER BY created_at DESC